Revit 2027 API
MEPSize Constructor
 Constructs an object that stores the basic size information for MEP duct, pipe, cable tray and conduit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSize(
	double nominalDiameter,
	double innerDiameter,
	double outerDiameter,
	bool usedInSizeLists,
	bool usedInSizing
)
Public Sub New (
	nominalDiameter As Double,
	innerDiameter As Double,
	outerDiameter As Double,
	usedInSizeLists As Boolean,
	usedInSizing As Boolean
)
public:
MEPSize(
	double nominalDiameter,
	double innerDiameter,
	double outerDiameter,
	bool usedInSizeLists,
	bool usedInSizing
)
new :
        nominalDiameter : float *
        innerDiameter : float *
        outerDiameter : float *
        usedInSizeLists : bool *
        usedInSizing : bool -> MEPSize
Parameters
nominalDiameter Double
 Nominal diameter. The value should be a valid, positive Revit length.
innerDiameter Double
 Inner diameter. The value should be a valid, positive Revit length.
outerDiameter Double
 Outer diameter. The value should be a valid, positive Revit length.
usedInSizeLists Boolean
 Whether it is used in size lists.
usedInSizing Boolean
 Whether is used in sizing.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for nominalDiameter must be greater than 0 and no more than 30000 feet. -or- The given value for innerDiameter must be greater than 0 and no more than 30000 feet. -or- The given value for outerDiameter must be greater than 0 and no more than 30000 feet.
See Also
Reference
MEPSize Class
Autodesk.Revit.DB Namespace